Функция ping()
	Возврат Истина;
КонецФункции

Функция LoadOperations(Сообщение)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипСообщения = Справочники.wsТипыСообщений.НайтиПоНаименованию("IntermechOperations");
	
	Приложение = wsОбработчики.ПодключитьОбработку(ТипСообщения, 
							Перечисления.wsНаправлениеСообщения.Входящее);
							
	Результат = Приложение.ВыполнитьПриложение(Сообщение);	
							
	ID = Неопределено;
	wsОбработчики.ЗаписатьСообщениеВОчередьСообщений(
		Сообщение, ТипСообщения, 
			Перечисления.wsНаправлениеСообщения.Входящее, ID,,Истина); // обработано...
		
	Возврат Результат;
		
КонецФункции

Функция _LoadOperations(Сообщение)

	УстановитьПривилегированныйРежим(Истина);
	
	ТипСообщения = Справочники.wsТипыСообщений.НайтиПоНаименованию("IntermechOperationsIn");
	
	ID = Неопределено;
	wsОбработчики.ЗаписатьСообщениеВОчередьСообщений(
		Сообщение, ТипСообщения, Перечисления.wsНаправлениеСообщения.Входящее, ID); 
		
	Если НЕ ЗначениеЗаполнено(ID) Тогда
		Возврат "Ошибка записи данных";
	КонецЕсли; 
	
	Возврат Сообщение;
	
	// дополнили сообщение в очереди...
	wsОбработчики.ОбработкаОчередиСообщений(ID);
	
	// отправили сообщение обратно...
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	wsОчередьСообщений.Сообщение КАК Сообщение
		|ИЗ
		|	РегистрСведений.wsОчередьСообщений КАК wsОчередьСообщений
		|ГДЕ
		|	wsОчередьСообщений.IDСообщения = &IDСообщения";
	
	Запрос.УстановитьПараметр("IDСообщения", ID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Ответ = Новый ХранилищеЗначения(Выборка.Сообщение, Новый СжатиеДанных(9));

	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ;

КонецФункции
