
&НаКлиенте
Процедура ОчиститьКаталогВременныхФайловОтОбработок(Команда)
	ОчиститьКаталогВременныхФайловОтОбработокНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчиститьКаталогВременныхФайловОтОбработокНаСервере()
	КаталогОбработки = КаталогВременныхФайлов();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	wsОбработки.ИмяОбработки КАК ИмяОбработки
		|ИЗ
		|	РегистрСведений.wsОбработки КАК wsОбработки";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИмяФайла = wsОбработчики.ПолучитьИмяФайлаОбработки(ВыборкаДетальныеЗаписи.ИмяОбработки, КаталогОбработки);
		УдалитьФайлы(ИмяФайла);
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ОбновитьОбработкиВКаталогеВременныхФайловНаСервере()
	КаталогОбработки = КаталогВременныхФайлов();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	wsОбработки.ИмяОбработки КАК ИмяОбработки
		|ИЗ
		|	РегистрСведений.wsОбработки КАК wsОбработки";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		wsОбработчики.ПолучитьОбработку(ВыборкаДетальныеЗаписи.ИмяОбработки);			
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбработкиВКаталогеВременныхФайлов(Команда)
	ОбновитьОбработкиВКаталогеВременныхФайловНаСервере();
КонецПроцедуры
