

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	// месяц нужен для поледующей очистки сообщений за месяц
	Запись.Месяц = НачалоМесяца(Запись.Дата);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ХранилищеЗначения = Новый ХранилищеЗначения(ТекущийОбъект.Сообщение);
	Если Не ЗначениеЗаполнено(ТекущийОбъект.IDСообщения) Тогда
		ТекущийОбъект.IDСообщения = Новый УникальныйИдентификатор;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДокументНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(Запись.НавигационнаяСсылка);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти