Функция ВыполнитьПриложение(ХранилищеЗначения, IDСообщения) Экспорт
	
	Сообщение = ХранилищеЗначения.Получить();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Сообщение);
	ОбXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	ЧтениеXML.Закрыть();
	
	Сообщения = "";
	
	Если ТипЗнч(ОбXDTO) = Тип("ОбъектXDTO") Тогда
		Результат = Обработать(ОбXDTO, IDСообщения);
	ИначеЕсли ТипЗнч(ОбXDTO) = Тип("СписокXDTO") Тогда
		Для каждого Item Из ОбXDTO Цикл
			Результат = Сообщения + " 
			|" + Обработать(Item, IDСообщения);
		КонецЦикла; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// обрабатываем не ТН, а Распоряжение на провес
Функция Обработать(Item, IDСообщения)
	
	Результат = Новый Структура("Документ, Сообщение");
	
	// Создать документ «АЭМ_ПриходныйОрдерИзАСЖДВ».
	// Проведен = Истина
	// Дата - Текущая дата
	// Номер - присваивается в соответствии с нумерацией на стороне приемника 
	// DATETIME	ДатаДокументаАСЖДВ	
	// NUMBER	НомерДокументаАСЖДВ	
	// WEIGHER	АвторДокументаАСЖДВ	
	// SUPPLIR_ID	КодПоставщика	
	// SUPPLIR_NAME	НаименованиеПоставщика	
	// Поставщик
	// Тип: Справочник «Контрагенты»	
	// 	Поиск элемента справочника «Контрагенты» осущетсвлять по реквизиту «Наименование»: 
	//			Контрагенты.НаименованиеПолное = SUPPLIR_NAME
	// VAGON	НомерЖДВагона	
	// CAR	НомерМашины	
	// CAR_BRAND	МаркаМашины	
	// WEIGHT_GROSS	ВесБрутто	
	// WEIGHT_TARE	ВесТары	
	// BLOCKAGE	Блокировка	
	// DRIVER	ФИОВодителя	
	// PASSPORT	Паспорт	
	// ROW_ID		
	// NOMENCLATURE_ID	КодНоменклатурыТМЦ	
	// NOMENCLATURE_NAME	НаименованиеНоменклатурыТМЦ	
	// Номенклатура
	// Тип: Справочник «Номенклатура»	Поиск элемента справочника «Номенклатура» осущетсвлять по реквизиту «Код»: 
	//		Номенклатруа.Код  = NOMENCLATURE_ID
	// WEIGHT	Количество	
	// UNIT		
	
	// Поищем такой же загруженный
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.АЭМ_ПриходныйОрдерИзАСЖДВ КАК Док
		|ГДЕ
		|	Док.НомерДокументаАСЖДВ = &Номер
		|	И Док.ДатаДокументаАСЖДВ = &Дата";
	
	Запрос.УстановитьПараметр("Дата", ПолучитьДатуИзСтроки(Item.DATETIME));
	Запрос.УстановитьПараметр("Номер", ПолучитьЗначение(Item.NUMBER));
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		НовыйОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	Иначе
		НовыйОбъект = Документы.АЭМ_ПриходныйОрдерИзАСЖДВ.СоздатьДокумент();
		НовыйОбъект.Дата = ТекущаяДатаСеанса();
		НовыйОбъект.УстановитьНовыйНомер();
	КонецЕсли; 
	
	Попытка
		НовыйОбъект.Заблокировать();
	Исключение
		Результат.Сообщение = "Не удалось заблокировать документ, обработаем сообщение в другой раз.";
		Возврат Результат;
	КонецПопытки;
	
	НовыйОбъект.ДатаДокументаАСЖДВ = ПолучитьДатуИзСтроки(Item.DATETIME);
	НовыйОбъект.НомерДокументаАСЖДВ = ПолучитьЗначение(Item.NUMBER);
	НовыйОбъект.АвторДокументаАСЖДВ = ПолучитьЗначение(Item.WEIGHER);
	НовыйОбъект.КодПоставщика = ПолучитьЗначение(Item.SUPPLIR_ID);
	НовыйОбъект.НаименованиеПоставщика = ПолучитьЗначение(Item.SUPPLIR_NAME);
	НовыйОбъект.Поставщик = Справочники.Контрагенты.НайтиПоРеквизиту("НаименованиеПолное", Item.SUPPLIR_NAME);
	НовыйОбъект.НомерЖДВагона = ПолучитьЗначение(Item.VAGON);
	НовыйОбъект.НомерМашины = ПолучитьЗначение(Item.CAR);
	НовыйОбъект.МаркаМашины = ПолучитьЗначение(Item.CAR_BRAND);
	НовыйОбъект.ВесБрутто = ПолучитьЗначение(Item.WEIGHT_GROSS);
	НовыйОбъект.ВесТары = ПолучитьЗначение(Item.WEIGHT_TARE);
	НовыйОбъект.Блокировка = ПолучитьЗначение(Item.BLOCKAGE);
	НовыйОбъект.ФИОВодителя = ПолучитьЗначение(Item.DRIVER);
	НовыйОбъект.Паспорт = ПолучитьЗначение(Item.PASSPORT);
	НовыйОбъект.КодНоменклатурыТМЦ = ПолучитьЗначение(Item.NOMENCLATURE_ID);
	НовыйОбъект.НаименованиеНоменклатурыТМЦ = ПолучитьЗначение(Item.NOMENCLATURE_NAME);
	НовыйОбъект.Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Item.NOMENCLATURE_ID);
	НовыйОбъект.Количество = ПолучитьЗначение(Item.WEIGHT);
	НовыйОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Результат.Документ = ПолучитьНавигационнуюСсылку(НовыйОбъект.Ссылка);
	
	Возврат Результат; 
	
КонецФункции // ()

Функция ПолучитьДатуИзСтроки(Стр) 
	
	ОписаниеТипа = Новый ОписаниеТипов("Дата");  
	Стр = СтрЗаменить(Стр, "-", "");
	Стр = СтрЗаменить(Стр, "T", "");
	Стр = СтрЗаменить(Стр, "Z", "");
	Стр = СтрЗаменить(Стр, ":", "");
	Возврат ОписаниеТипа.ПривестиЗначение(Стр); 

КонецФункции

Функция ПолучитьЗначение(Стр) 
	Если ТипЗнч(Стр) = Тип("Строка") ИЛИ ТипЗнч(Стр) = Тип("Число")  Тогда
		Возврат Стр;
	Иначе
		Возврат "";
	КонецЕсли; 
КонецФункции
