
&НаСервере
Процедура ОбработатьЗаписиНаСервере()
	wsОбработчики.ОбработкаОчередиСообщений();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗаписи(Команда)
	ОбработатьЗаписиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗаписьНаСервере(ТипСообщения, Сообщение)
	wsОбработчики.ОбработатьСообщение(ТипСообщения, Сообщение);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗапись(Команда)
	ОбработатьЗаписьНаСервере(Элементы.Список.ТекущаяСтрока.ТипСообщения, Элементы.Список.ТекущаяСтрока.Сообщение);
КонецПроцедуры
