
Функция put(Сообщение, Тип)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипСообщения = Справочники.wsТипыСообщений.НайтиПоНаименованию(Тип);
	
	Если Не ЗначениеЗаполнено(ТипСообщения) Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	wsОбработчики.ЗаписатьСообщениеВОчередьСообщений(Сообщение, ТипСообщения); 
	
	ПараметрыФоновогоЗадания = Новый Массив;
	ФоновыеЗадания.Выполнить("wsОбработчики.ОбработкаОчередиСообщений",
				ПараметрыФоновогоЗадания, Новый УникальныйИдентификатор, "Обработка очереди сообщений""");
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

