
&НаКлиенте
Процедура ПодключитьООбработку(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьЗавершение", ЭтаФорма); //ЭтотОбъект);
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок     	   = "Выберите файл: ";
	ДиалогОткрытияФайла.Фильтр 		 	   = "(*.xsd)|*.xsd";
	
    НачатьПомещениеФайла(ОписаниеОповещения, , ДиалогОткрытияФайла, Истина, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
    Если НЕ Результат Тогда
        Возврат;
    КонецЕсли;
    АдресФайла = Адрес;
    Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
        ТекущийОбъект.СхемаXSD = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайла));
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОбработку(Команда)
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(Режим);
	Фильтр = "Обработка(*.xsd)|*.xsd";
	ДиалогСохраненияФайла.Фильтр = Фильтр;
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
	ДиалогСохраненияФайла.Заголовок = "Выберите файл для сохранения";
	ДиалогСохраненияФайла.Показать(Новый ОписаниеОповещения("СохранитьФайлЗавершение", ЭтаФорма, Новый Структура("ДиалогСохраненияФайла", ДиалогСохраненияФайла)));
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	ДиалогСохраненияФайла = ДополнительныеПараметры.ДиалогСохраненияФайла;
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилищеНаСервере();
		Если Не АдресВоВременномХранилище = Неопределено Тогда
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
			ДвоичныеДанные.Записать(ДиалогСохраненияФайла.ПолноеИмяФайла);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	wsТипыСообщений.СхемаXSD КАК СхемаXSD
		|ИЗ
		|	Справочник.wsТипыСообщений КАК wsТипыСообщений
		|ГДЕ
		|	wsТипыСообщений.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	ДвоичныеДанные = ВыборкаДетальныеЗаписи.СхемаXSD.Получить();
	Если Не ДвоичныеДанные = Неопределено Тогда
		АдресПомещения = Новый УникальныйИдентификатор;
		Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, АдресПомещения);
	КонецЕсли; 
	
	Сообщить("Нет данных для выгрузки.");
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ОтобразитьСхему()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	wsТипыСообщений.СхемаXSD КАК СхемаXSD
		|ИЗ
		|	Справочник.wsТипыСообщений КАК wsТипыСообщений
		|ГДЕ
		|	wsТипыСообщений.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ВыборкаДетальныеЗаписи.СхемаXSD = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДвоичныеДанные = ВыборкаДетальныеЗаписи.СхемаXSD.Получить();
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 

	ЧтениеДанных = Новый ЧтениеДанных(ДвоичныеДанные);
	СхемаXSD = ЧтениеДанных.ПрочитатьСимволы(,КодировкаТекста.UTF8);
	Возврат Неопределено;
	
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтобразитьСхему();
КонецПроцедуры

