Функция ПолучитьГлобальноеЗначение(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	wsГлобальныеЗначения.Значение КАК Значение,
		|ИЗ
		|	ПланВидовХарактеристик.wsГлобальныеЗначения.Список КАК wsГлобальныеЗначенияСписок
		|ГДЕ
		|	wsГлобальныеЗначения.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	ВыборкаЗначение = РезультатЗапроса.Выбрать();
	ВыборкаЗначение.Следующий();
	Возврат ВыборкаЗначение.Значение;

КонецФункции // ()

Функция ПолучитьГлобальноеЗначениеПоСсылке(Ссылка) Экспорт
	
	Список = Новый ТаблицаЗначений();
	Список.Колонки.Добавить("Значение1");
	Список.Колонки.Добавить("Значение2");
	
	Результат = Новый Структура("Значение, Список", Неопределено, Список);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	wsГлобальныеЗначения.Значение КАК Значение,
		|	wsГлобальныеЗначенияСписок.Значение1,
		|	wsГлобальныеЗначенияСписок.Значение2
		|ИЗ
		|	ПланВидовХарактеристик.wsГлобальныеЗначения.Список КАК wsГлобальныеЗначенияСписок
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.wsГлобальныеЗначения КАК wsГлобальныеЗначения
		|		ПО wsГлобальныеЗначенияСписок.Ссылка = wsГлобальныеЗначения.Ссылка
		|ГДЕ
		|	wsГлобальныеЗначения.Ссылка = &Ссылка
		|ИТОГИ ПО
		|	Значение";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли; 
	
	ВыборкаЗначение = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗначение.Следующий() Цикл
		
		Результат.Вставить("Значение", ВыборкаЗначение.Значение);
	
		ВыборкаДетальныеЗаписи = ВыборкаЗначение.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Список.Добавить(), ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
		Результат.Вставить("Список", Список);		
		
	КонецЦикла;
	
	
	Возврат Результат;

КонецФункции // ()
 
Функция НайтиСписокПоЗначению(Значение) Экспорт
	
	Список = Новый ТаблицаЗначений();
	Список.Колонки.Добавить("Значение1");
	Список.Колонки.Добавить("Значение2");
	
	Результат = Новый Структура("Значение, Список", Значение, Список);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	_ГлобальныеЗначения.Значение КАК Значение,
		|	_ГлобальныеЗначенияСписок.Значение1,
		|	_ГлобальныеЗначенияСписок.Значение2
		|ИЗ
		|	ПланВидовХарактеристик.wsГлобальныеЗначения.Список КАК _ГлобальныеЗначенияСписок
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.wsГлобальныеЗначения КАК _ГлобальныеЗначения
		|		ПО _ГлобальныеЗначенияСписок.Ссылка = _ГлобальныеЗначения.Ссылка
		|ГДЕ
		|	_ГлобальныеЗначения.Значение = &Значение
		|ИТОГИ ПО
		|	Значение";
	
	Запрос.УстановитьПараметр("Значение", Значение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли; 
	
	ВыборкаЗначение = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗначение.Следующий() Цикл
		
		Результат.Вставить("Значение", ВыборкаЗначение.Значение);
	
		ВыборкаДетальныеЗаписи = ВыборкаЗначение.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Список.Добавить(), ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
		Результат.Вставить("Список", Список);		
		
	КонецЦикла;
	
	
	Возврат Результат;

КонецФункции // ()

Функция НайтиВСпискеЗначение2ПоЗначению1(Знач Ссылка, Знач Значение1) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	_ГлобальныеЗначенияСписок.Значение2
		|ИЗ
		|	ПланВидовХарактеристик.wsГлобальныеЗначения.Список КАК _ГлобальныеЗначенияСписок
		|ГДЕ
		|	_ГлобальныеЗначенияСписок.Ссылка = &Ссылка
		|	И _ГлобальныеЗначенияСписок.Значение1 = &Значение1";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Значение1", Значение1);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	ВыборкаЗначение = РезультатЗапроса.Выбрать();
	ВыборкаЗначение.Следующий();
	
	Возврат ВыборкаЗначение.Значение2;	
	
КонецФункции // ()

Функция НайтиВСпискеЗначенияПоЗначению1(Знач Ссылка, Знач Значение1) Экспорт
	
	Результат = Новый Структура("Значение2, Значение3");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	_ГлобальныеЗначенияСписок.Значение2,
		|	_ГлобальныеЗначенияСписок.Значение3
		|ИЗ
		|	ПланВидовХарактеристик.wsГлобальныеЗначения.Список КАК _ГлобальныеЗначенияСписок
		|ГДЕ
		|	_ГлобальныеЗначенияСписок.Ссылка = &Ссылка
		|	И _ГлобальныеЗначенияСписок.Значение1 = &Значение1";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Значение1", Значение1);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	ВыборкаЗначение = РезультатЗапроса.Выбрать();
	ВыборкаЗначение.Следующий();
	ЗаполнитьЗначенияСвойств(Результат, ВыборкаЗначение);
	
	Возврат Результат;
	
КонецФункции // ()
