
Функция ВыгрузитьВФоне(Ссылка, НаименованиеПодключаемойОбработки, ПростаяПередачаПараметров = Истина) Экспорт
	
	Асинхронно = Истина;
	
	ПараметрыФоновогоЗадания = Новый Массив;
	ПараметрыФоновогоЗадания.Добавить(Ссылка); 
	ПараметрыФоновогоЗадания.Добавить(НаименованиеПодключаемойОбработки); 
	ПараметрыФоновогоЗадания.Добавить(ПростаяПередачаПараметров); 
	ПараметрыФоновогоЗадания.Добавить(Асинхронно); 
	ФоновыеЗадания.Выполнить("aemОбщийМодуль.Выгрузить",
				ПараметрыФоновогоЗадания, Новый УникальныйИдентификатор, 
					"Выгрузить сообщение ws"); 	
	
КонецФункции

Функция Выгрузить(Ссылка, НаименованиеПодключаемойОбработки, ПростаяПередачаПараметров = Истина, Асинхронно = Ложь) Экспорт
	
	Если Асинхронно Тогда
		
		// надо дать завершиться транзации
		Сч = 0;
		Версия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ВерсияДанных");
		Пока Версия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ВерсияДанных") ИЛИ Сч = 100 Цикл
			ЗадержкаСекунд = 5;
			СтрокаЗапроса = "ping -n 1 -w "+Формат(1000 * ЗадержкаСекунд, "ЧДЦ=0; ЧГ=") + " 127.255.255.255"; 
			WshShell = Новый COMОбъект("WScript.Shell"); 
			WshShell.Run(СтрокаЗапроса, 0, -1); 
			Сч = Сч + 1;
		КонецЦикла; 
		
	КонецЕсли; 
	
	// подлючаем внешнююю обработку 
	ТипСообщения = wsОбработчики.НайтиСоздатьТипСообщения(НаименованиеПодключаемойОбработки);
	Если Не ЗначениеЗаполнено(ТипСообщения) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найден тип сообщения для подключаемой обработки " + НаименованиеПодключаемойОбработки;
		Сообщение.Сообщить(); 
		Возврат Ложь;
	КонецЕсли;
	
	ИмяОбработки = СтрЗаменить(НаименованиеПодключаемойОбработки, " ", "");
	Приложение = wsОбработчики.ПодключитьОбработку(ТипСообщения, Перечисления.wsНаправлениеСообщения.Исходящее);
							
	Если Приложение = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найден обработчик " + НаименованиеПодключаемойОбработки;
		Сообщение.Сообщить(); 
		Возврат Ложь;
	Иначе
		Попытка
			
			Если ПростаяПередачаПараметров Тогда
				Результат = Приложение.ВыполнитьПриложение(Ссылка, ТипСообщения);	
			Иначе				
				ПараметрыПроцедуры = Новый Структура;
				ПараметрыПроцедуры.Вставить("Ссылка", Ссылка);
				ПараметрыПроцедуры.Вставить("ТипСообщения", ТипСообщения);
			    Результат = Приложение.ВыполнитьПриложение(ПараметрыПроцедуры);	
			КонецЕсли;
			
			
			Возврат Истина;
		Исключение
			СообщениеОбОшибке = ОписаниеОшибки();		
			Сообщить(СообщениеОбОшибке);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли; 
	
Конецфункции
							